[
  {
    "id": "tg_accurate",
    "name": "ACCURATE",
    "description": "Attacks made with this weapon or technique receive +1 Accuracy."
  },
  {
    "id": "tg_aetheric",
    "name": "AETHERIC",
    "description": "Attacks with this tag target A-Def instead of Dodge."
  },
  {
    "id": "tg_armor",
    "name": "ARMOR",
    "description": "This support item or technique is a piece of wearable armor. You can only equip 1 armor item at a time."
  },
  {
    "id": "tg_arcing",
    "name": "ARCING",
    "description": "This weapon or technique can be fired over obstacles, usually by lobbing a projectile in an arc. Attacks made with this weapon don’t require line of sight, as long as it’s possible to trace a path to the target; however, they are still affected by cover."
  },
  {
    "id": "tg_aura",
    "name": "AURA {VAL}",
    "description": "Auras affect certain characters within {VAL} spaces of the character that activates the aura. Characters can only have 1 aura activated at a time, and can change auras 1/turn"
  },
  {
    "id": "tg_aura_e",
    "name": "AURA",
    "description": "Auras affect certain characters within SCOPE spaces of the character that activates the aura. Characters can only have 1 aura activated at a time, and can change auras 1/turn"
  },
  {
    "id": "tg_auto_hit",
    "name": "AUTO HIT",
    "description": "This attack automatically hits, no attack roll is made."
  },
  {
    "id": "tg_blast",
    "name": "BLAST {VAL}",
    "description": "This is an AOE. It affects all characters within a radius of {VAL} spaces from the center space, including the center space. Cover and line of sight are calculated from the center space of the AOE. Users can be affected by their own Blast.",
    "filter_ignore": true
  },
  {
    "id": "tg_breaking",
    "name": "BREAKING",
    "description": "This ability can only be used if the user is BREAKING (Stress equal to at least half of their Stress Cap)."
  },
  {
    "id": "tg_burst",
    "name": "BLAST {VAL}",
    "description": "This is an AOE. It affects all characters within a radius of {VAL} spaces from the occupied spaces of the target, excluding the target. Cover and line of sight are calculated from the center space of the AOE. Bursts that form a zone move with the target.",
    "filter_ignore": true
  },
  {
    "id": "tg_close_blast",
    "name": "CLOSE BLAST {VAL}",
    "description": "This is an AOE. It operates like a Blast, but at least 1 space must be adjacent to the user, the user can’t be in the area, and cover/line of sight are calculated from the user.",
    "filter_ignore": true
  },
  {
    "id": "tg_consumable",
    "name": "CONSUMABLE {VAL}",
    "description": "This weapon or system can only be used {VAL} times per quest. Some abilities can replenish them."
  },
  {
    "id": "tg_discord",
    "name": "DISCORD {VAL}",
    "description": "On a hit, this attack deals {VAL} Discord to its target. They immediately take that much discord damage, ignoring Armor, then mark {VAL} Discord on their sheet, adding it to any existing Discord. At the end of their turn, characters with Discord make an MGK check. On a success, they clear all marked discord; on a failure, they take damage equal to their total marked discord."
  },
  {
    "id": "tg_discord_self",
    "name": "DISCORD {VAL} (SELF)",
    "description": "Immediately after using this weapon or system, the user takes {VAL} Discord."
  },
  {
    "id": "tg_enchanted",
    "name": "ENCHANTED",
    "description": "This ability has been augmented with an enchantment."
  },
  {
    "id": "tg_enchantment",
    "name": "ENCHANTMENT",
    "description": "This enchantment can be applied to an ability. Each ability can only have one enchantment, and cannot have more than one of the same enchantment."
  },
  {
    "id": "tg_focus",
    "name": "FOCUS {VAL}",
    "description": "This ability costs {VAL} focus to use. Focus is a temporary resource used in combat scenes."
  },
  {
    "id": "tg_free_action",
    "name": "FREE ACTION",
    "description": "Characters can take free actions at any point during their turn, and they don’t count toward the number of minor or standard actions they take. They can also be used to take actions more than once per turn.",
    "filter_ignore": true
  },
  {
    "id": "tg_homing",
    "name": "HOMING",
    "description": "Homing abilities ignore Line of Sight and the effects of cover. As long as the target is within Range and it is possible to reach them (basically as long as they aren’t in a box), they can be affected."
  },
  {
    "id": "tg_inaccurate",
    "name": "INACCURATE",
    "description": "Attacks made with this weapon or technique receive +1 Difficulty."
  },
  {
    "id": "tg_indirect",
    "name": "INDIRECT",
    "description": "Attacks with this tag ignore the effects of cover."
  },
  {
    "id": "tg_integrated",
    "name": "INTEGRATED",
    "description": "Integrated abilities can’t be destroyed or enchanted. They can’t be selected as an option from a wound roll."
  },
  {
    "id": "tg_invisible",
    "name": "INVISIBLE",
    "description": "This unit is Invisible",
    "filter_ignore": true
  },
  {
    "id": "tg_invulnerable",
    "name": "INVULNERABLE",
    "description": "This equipment is immune to all damage.",
    "filter_ignore": true
  },
  {
    "id": "tg_limited",
    "name": "LIMITED {VAL}",
    "description": "This weapon or system can only be used {VAL} times per quest."
  },
  {
    "id": "tg_line",
    "name": "LINE {VAL}",
    "description": "This is an Area of Effect (AoE). Its area is a straight line with a length of {VAL} spaces and a width of 1 space, drawn directly away from you in any direction.",
    "filter_ignore": true
  },
  {
    "id": "tg_loot",
    "name": "LOOT",
    "description": "LOOT is a general tag for equipment that exists as random drops usually and are not balanced.",
    "filter_ignore": true
  },
  {
    "id": "tg_mana",
    "name": "MANA {VAL}",
    "description": "This ability costs {VAL} mana to use."
  },
  {
    "id": "tg_minor_action",
    "name": "MINOR ACTION",
    "description": "This ability can be used as a Minor Action"
  },
  {
    "id": "tg_ordnance",
    "name": "ORDNANCE",
    "description": "This weapon can only be fired before the user moves or takes any other actions on their turn, excepting Protocols. The user can still act and move normally after attacking. Additionally, because of its size, this weapon can’t be used against targets in engagement with the user’s mech, and cannot be used for Overwatch."
  },
  {
    "id": "tg_overkill",
    "name": "OVERKILL",
    "description": "When rolling for damage with this weapon, any damage dice that land on a 1 cause the attacker to take 1 Stress, and are then rerolled. Additional 1s continue to trigger this effect."
  },
  {
    "id": "tg_piercing",
    "name": "PIERCING",
    "description": "Damage with this tag ignores Armor."
  },
  {
    "id": "tg_polymorph",
    "name": "POLYMORPH",
    "description": "Abilities with this tag modify a character’s form. A character can only be under the effect of one ability with this tag at a time."
  },
  {
    "id": "tg_pull",
    "name": "PULL {VAL}",
    "description": "A type of forced movement. On a hit, the target is moved {VAL} spaces directly towards the origin."
  },
  {
    "id": "tg_push",
    "name": "PUSH {VAL}",
    "description": "A type of forced movement. On a hit, the target is moved {VAL} spaces directly away from the origin."
  },
  {
    "id": "tg_range",
    "name": "RANGE ({VAL})",
    "description": "The range at which an ability can be used.",
    "filter_ignore": true
  },
  {
    "id": "tg_reach",
    "name": "REACH {VAL}",
    "description": "The range at which an ability can be used. Reach can be used to make Opportunity Attacks."
  },
  {
    "id": "tg_reaction",
    "name": "REACTION",
    "description": "This ability is used as a reaction."
  },
  {
    "id": "tg_recharge",
    "name": "RECHARGE {VAL}+",
    "description": "Once this system or weapon has been used, it can’t be used again until it is recharged. At the start of this NPC`s turn, roll 1d6: if the result is equal to or greater {VAL}, the equipment can be used again. Only one roll is required for each NPC, even if an NPC has multiple Recharge systems or weapons. If this NPC has two Recharge systems with target numbers of 4+ and 5+, a roll of 5 will recharge both.",
    "filter_ignore": true
  },
  {
    "id": "tg_reliable",
    "name": "RELIABLE {VAL}",
    "description": "Reliable abilities always deal at least {VAL} damage, even if they would miss or deal less than {VAL} damage. Reliable damage inherits the ability’s damage type and tags. However, Reliable damage does not count as a hit, and doesn’t trigger any effects that require a hit."
  },
  {
    "id": "tg_reloading",
    "name": "RELOADING",
    "description": "Abilities with this tag must be reloaded after each use before they can be used again. The [1]RECOVER action and other abilities allow reloading."
  },
  {
    "id": "tg_resistall",
    "name": "RESISTANCE (ALL)",
    "description": "This unit has Resistance to all damage types",
    "filter_ignore": true
  },
  {
    "id": "tg_resistance",
    "name": "RESISTANCE",
    "description": "Reduce all damage from a source you have resistance to by half"
  },
  {
    "id": "tg_round",
    "name": "{VAL}/ROUND",
    "description": "This ability can be used {VAL} number of times per round"
  },
  {
    "id": "tg_set_damage_type",
    "name": "SET DAMAGE TYPE",
    "description": "Allow player to set the damage type for this equipment (HIDDEN TAG)",
    "hidden": true
  },
  {
    "id": "tg_set_damage_value",
    "name": "SET DAMAGE VALUE",
    "description": "Allow player to set the damage value for this equipment (HIDDEN TAG)",
    "hidden": true
  },
  {
    "id": "tg_set_max_uses",
    "name": "SET MAX USES",
    "description": "Allow player to set the maximum uses for this equipment (HIDDEN TAG)",
    "hidden": true
  },
  {
    "id": "tg_slide",
    "name": "SLIDE {VAL}",
    "description": "A type of forced movement. On a hit, the target is moved {VAL} spaces in any direction"
  },
  {
    "id": "tg_slow",
    "name": "SLOW",
    "description": "This weapon or technique can only be used as a (7) FULL ATTACK action or when explicitly stated"
  },
  {
    "id": "tg_standard_action",
    "name": "STANDARD ACTION",
    "description": "This ability can be used as a Standard Action"
  },
  {
    "id": "tg_stress_self",
    "name": "STRESS {VAL} (SELF)",
    "description": "Immediately after using this weapon or system, the user takes {VAL} Stress."
  },
  {
    "id": "tg_summon",
    "name": "SUMMON",
    "description": "Summons are temporary characters under the control of another character. Summons have the following statistics unless otherwise indicated: Size 1/2, 5 HP, 10 Dodge/A-Def, 0 Speed, Save Target = Summoner’s save target, BULK/AGILITY/MIND/MAGIC 0. Summons can only be created in free spaces that they could normally enter (you can’t summon into impassable terrain, for example). Summons are characters with a standard action, standard movement, and minor action. However, they can’t take any actions or movement unless they have an ability that lets them take actions or have a speed. Their turn is their summoner’s turn, and if they can take actions/move, they can do so at any point in their summoner’s turn. Summons are defeated if they are reduced to 0 HP. Summons can be dismissed as a free action by their summoner. Summons last until dismissed, the end of the scene, or until defeated. Abilities that create summons can only have 1 summon from that instance of that ability at a time. If a summon is defeated or dismissed, new ones can be made from that same ability. Summons can’t create summons."
  },
  {
    "id": "tg_temp_hp",
    "name": "TEMP HP",
    "description": "This ability provides HP that disappears at the end of the scene or when a specified condition is met, stacking on top of existing HP. Temporary HP does not stack with itself unless otherwise stated."
  },
  {
    "id": "tg_thrown",
    "name": "THROWN {VAL}",
    "description": "Abilities with this tag can be thrown, making a melee attack against a target within X spaces. Thrown attacks are affected by cover. If throwing a weapon, it lands in a space adjacent to the target (thrower’s choice), and must be picked up as a free action while adjacent to it before it can be used again."
  },
  {
    "id": "tg_trap",
    "name": "TRAP",
    "description": "Traps are effects that modify a space. Traps are placed in free adjacent spaces, and arm at the end of the turn they are placed. Characters that move into or adjacent to a trap’s space trigger it, activating its effects and then removing it from play. Traps are permanently HIDDEN, but can be automatically detected with the [3]SEARCH action. A detected trap can be disarmed by passing an AGILITY check as a minor action when moving into or adjacent to a trap’s space before it is triggered. On a success, the trap is removed from play without being activated. On a failure, the trap activates as normal. Traps are visible to all players on the map."
  },
  {
    "id": "tg_turn",
    "name": "{VAL}/TURN",
    "description": "This ability can be used {VAL} number of times in any turn."
  },
  {
    "id": "tg_unbreakable",
    "name": "UNBREAKABLE",
    "description": "This ability cannot be destroyed. Unbreakable abilities can’t be selected to be destroyed if there are non-unbreakable options left. If an Unbreakable item is selected from a Wound or Overstress roll, it becomes a DAZED result instead.",
    "filter_ignore": true
  },
  {
    "id": "tg_unique",
    "name": "UNIQUE",
    "description": "Characters can only equip one copy of an ability with this tag at a time."
  }
]