[
    {
        "id": "Archmage1",
        "talent": "Archmage",
        "name": "Spell Sculptor",
        "effect": "When you use a spell or artifact with an area of effect (Blast, Burst, Close Blast, Line), you can spend 1 mana to exclude 1 target from the area.",
        "rank": "1 "
    },
    {
        "id": "Archmage2",
        "talent": "Archmage",
        "name": "Arcane Turret",
        "effect": "When you are CHANNELING, your armor increases by +2, to a maximum of 4. Taking Stress doesn’t trigger Concentration saves.",
        "rank": "2 "
    },
    {
        "id": "Archmage3",
        "talent": "Archmage",
        "name": "Focused Caster",
        "effect": "The following option is added to the REROLL TABLE:\u0085a. Spend 1 mana to reroll.",
        "rank": "3 "
    },
    {
        "id": "Armored Defender1",
        "talent": "Armored Defender",
        "name": "Reinforced Plating",
        "effect": "When you (1) DEFEND, after gaining Focus you can temporarily increase your armor by +1 per Focus spent, to a maximum of 6 armor. This increase lasts until the start of your next turn or until you take Physical, Astral, Lunar, or Force damage. ",
        "rank": "1 "
    },
    {
        "id": "Armored Defender2",
        "talent": "Armored Defender",
        "name": "Adamantine Armor",
        "effect": "Your support items with the [ARMOR] tag gain the [UNBREAKABLE] tag.",
        "rank": "2 "
    },
    {
        "id": "Armored Defender3",
        "talent": "Armored Defender",
        "name": "Battle Hardened",
        "effect": "When you take damage but reduce it to 0, you negate all other effects of the attack/ability on you, including on hit effects.",
        "rank": "3 "
    },
    {
        "id": "Artificer1",
        "talent": "Artificer",
        "name": "Experimental Weapon",
        "effect": "When you gain this talent and during a Long Rest, you create an experimental weapon which is equipped for free. You can only have one experimental weapon at a time.\u0085[WEAPON] Main Magitech, Unique\u0085[Custom Range] [1d6+1 Damage]\u0085When this weapon is created and during a Long Rest, you can choose to change the following:\u0085• Range: Reach 1 (Counts as melee weapon) or Range 10 (counts as ranged weapon)\u0085• Damage Type: Physical, Astral, Lunar, or Force\u0085After you use this weapon roll a d6. On a 4-6 the weapon malfunctions and must be RELOADED before being used again.",
        "rank": "1 "
    },
    {
        "id": "Artificer2",
        "talent": "Artificer",
        "name": "Improvements",
        "effect": "Your experimental weapon malfunctions on a 5-6. When you create your experimental weapon or during a Long Rest, choose two of the following improvements for your weapon.\u0085• Tags (Can be Chosen Twice). Your Experimental weapon gains one of the following tags: Accurate, Aetheric, Arcing, Push 1, Reliable 2, Thrown 5.\u0085• Area Pattern. When you attack with your experimental weapon, you can choose to make it one of the following AOEs instead of a normal attack. If you do so, you roll twice to determine malfunction and keep the highest result.\u0085i. Ranged Weapon: Line 8, or Blast 1 with weapon’s range. \u0085ii. Melee Weapon: Burst 1 or Close Blast 1",
        "rank": "2 "
    },
    {
        "id": "Artificer3",
        "talent": "Artificer",
        "name": "Perfection",
        "effect": "Your experimental weapon only malfunctions on a d6. When you create your experimental weapon or during a Long Rest, choose one of the following improvements to your weapon.\u0085• Increased Range. If your weapon is melee, it gains +1 reach. If it is ranged, it gains +5 range. \u0085• Increased Damage. Your weapon’s damage becomes 1d6+3 \u0085• Punch Through. Your weapon gains Piercing.",
        "rank": "3 "
    },
    {
        "id": "Artillerist1",
        "talent": "Artillerist",
        "name": "Siege Mode",
        "effect": "Instead of using your Standard Movement to move, you can instead enter or exit your Siege Mode. While in Siege Mode, you are always IMMOBILIZED, and your ranged weapon attacks gain +3 Range and ARCING.",
        "rank": "1 "
    },
    {
        "id": "Artillerist2",
        "talent": "Artillerist",
        "name": "Siege Ammo",
        "effect": "1/round when you make a ranged weapon attack while in Siege Mode, you can spend 1 mana to create a [Burst 1] area around one of the attack’s target and choose one of the following effects. The primary target is included in the area.\u0085• Aethermarker Round. All characters in the area must pass a MGK save or become MARKED.\u0085• Concussion Round. All characters in the area must pass a MND save or be DAZED until the end of their next turn.\u0085• Grounding Round. All characters in the area must pass a BLK save or be knocked PRONE.\u0085• Shrapnel Round. All characters in the area must pass an AGI save or take [2 Piercing Physical].",
        "rank": "2 "
    },
    {
        "id": "Artillerist3",
        "talent": "Artillerist",
        "name": "Aetheric Bombard",
        "effect": "While in Siege Mode, your Scope increases by +3 and your spells gain ARCING. You are immune to all forced movement in Siege Mode, and gain Soft Cover from attacks further than [Range 8] from you.",
        "rank": "3 "
    },
    {
        "id": "Brawler1",
        "talent": "Brawler",
        "name": "Quick Hands",
        "effect": "As a Minor Action, you can take [1 Stress] to (5) GRAPPLE or (5) SHOVE. You gain +1 ACC on attacks against targets you are grappling.",
        "rank": "1 "
    },
    {
        "id": "Brawler2",
        "talent": "Brawler",
        "name": "Fisticuffs",
        "effect": "Your IMPROVISED ATTACK deals [1d6 Physical], and gains a Reach of 1 which allows it to be used for opportunity attacks. On a crit, choose one: \u0085• The target is DAZED until the end of their next turn. \u0085• You can automatically succeed on a (5) SHOVE against the target.",
        "rank": "2 "
    },
    {
        "id": "Brawler3",
        "talent": "Brawler",
        "name": "Submission",
        "effect": "You gain the following (2) CHANNEL ability.  \u0085(6) Release: Make a melee attack with a club, including SLOW ones.  \u0085On Hit: The weapon deals its normal damage and effects, and the target is STUNNED until the end of their next turn.  \u0085On Miss: The weapon deals its normal damage and effects, but doesn’t trigger any on hit effects or tags like Push, Pull, etc.  ",
        "rank": "3 "
    },
    {
        "id": "Breaker1",
        "talent": "Breaker",
        "name": "Dazing Blows",
        "effect": "1/round when you hit a character with a club, the target must pass a BLK save or be DAZED until the end of their next turn.",
        "rank": "1 "
    },
    {
        "id": "Breaker2",
        "talent": "Breaker",
        "name": "Sunder Armor",
        "effect": "When you crit with a club, the target is SUNDERED until the end of their next turn and their armor is decreased by 1 (to a minimum of 0) until the end of the scene.",
        "rank": "2 "
    },
    {
        "id": "Breaker3",
        "talent": "Breaker",
        "name": "Ring the Bell",
        "effect": "You gain the following (2) CHANNEL ability.  \u0085(6) Release: Make a melee attack with a club, including SLOW ones.  \u0085On Hit: The weapon deals its normal damage and effects, and the target is STUNNED until the end of their next turn. A target can only be stunned by this ability 1/scene. \u0085On Miss: The weapon deals its normal damage and effects, but doesn’t trigger any on hit effects or tags like Push, Pull, etc.  ",
        "rank": "3 "
    },
    {
        "id": "Called Shots1",
        "talent": "Called Shots",
        "name": "Precision",
        "effect": "As a Minor Action, you can take [1 Stress] to gain +1 ACC on your next attack roll this turn. If it’s a crit, it gains the Piercing tag.",
        "rank": "1 "
    },
    {
        "id": "Called Shots2",
        "talent": "Called Shots",
        "name": "Body Parts",
        "effect": "1/round when you crit with an attack roll, you can choose to deal half damage in order to apply one of the following additional effects:\u0085a. Foot. Target is IMMOBILIZED until the end of their next turn.\u0085b. Head. Target is DAZED until the end of their next turn.\u0085c. Leg. Target is SLOWED until the end of their next turn",
        "rank": "2 "
    },
    {
        "id": "Called Shots3",
        "talent": "Called Shots",
        "name": "Pinpoint Lethality",
        "effect": "The following options are added to the body parts list:\u0085a. Arm. Target is DISARMED until the end of their next turn.\u0085b. Throat. Target is SILENCED until the end of their next turn.\u0085c. Eye. Target is BLINDED until the end of their next turn",
        "rank": "3 "
    },
    {
        "id": "Commander1",
        "talent": "Commander",
        "name": "Commander`s Mark",
        "effect": "When you make a character MARKED, you can make it a special Commander’s Mark. It functions as a normal mark, but when an ally consumes it, you roll a 1d6. On a 5+, they stay MARKED with the Commander’s Mark. You can only have 1 Commander’s Mark at a time, and placing a new one turns the old one into a normal mark.",
        "rank": "1 "
    },
    {
        "id": "Commander2",
        "talent": "Commander",
        "name": "Planning",
        "effect": "When an ally takes stress to reroll an attack against your COMMANDER’S MARK target, the stress cost is reduced by 1. The COMMANDER’S MARK remains on a 4+ instead of a 5+.",
        "rank": "2 "
    },
    {
        "id": "Commander3",
        "talent": "Commander",
        "name": "Order",
        "effect": "1/Round when you make a target MARKED, you can announce an action that you want any ally to take against that target. The first ally that takes that action against the target while it is MARKED gains 2+ your GRIT temp HP. ",
        "rank": "3 "
    },
    {
        "id": "Copycat1",
        "talent": "Copycat",
        "name": "Scan",
        "effect": "You can (3) SEARCH as a Minor Action.",
        "rank": "1 "
    },
    {
        "id": "Copycat2",
        "talent": "Copycat",
        "name": "Copy",
        "effect": "When you (3) SEARCH an enemy to learn about their equipment and techniques, you can spend 1 mana to gain access to one of those pieces of equipment or techniques until the end of the scene. You can only copy 1 thing at a time.",
        "rank": "2 "
    },
    {
        "id": "Copycat3",
        "talent": "Copycat",
        "name": "Imitate",
        "effect": "You can now gain access to enemy traits as well. You can copy a piece of equipment, technique, or trait as soon as you see it used by spending 1 mana.  You can have up to two things copied at once.",
        "rank": "3 "
    },
    {
        "id": "Dervish1",
        "talent": "Dervish",
        "name": "Twin Strike",
        "effect": "Whenever you hit a character with two different attacks in a turn, you don’t provoke Reaction attacks from them until the end of that turn. You gain +1 Accuracy on linked attacks (the 2nd attack with a linked weapon).",
        "rank": "1 "
    },
    {
        "id": "Dervish2",
        "talent": "Dervish",
        "name": "Whirling",
        "effect": "1/round whenever you hit with two different LIGHT weapons during your turn, you begin whirling until the end of your turn. You can consume whirling as a free action to create a [Burst 1] area, dealing [3 Physical] to enemies in the area. You can move up to 3 spaces immediately before or after creating the Burst area.",
        "rank": "2 "
    },
    {
        "id": "Dervish3",
        "talent": "Dervish",
        "name": "Dual Wielder",
        "effect": "A [MAIN] or [LIGHT∞LIGHT] weapon slot becomes a [MAIN∞LIGHT] slot, or a [LIGHT] slot becomes a [LIGHT∞LIGHT] slot. ",
        "rank": "3 "
    },
    {
        "id": "Soldier1",
        "talent": "Soldier",
        "name": "Weapon Focus",
        "effect": "You gain +1 ACC on the first melee attack roll you make on a turn with a MAIN weapon.",
        "rank": "1 "
    },
    {
        "id": "Soldier2",
        "talent": "Soldier",
        "name": "Stances",
        "effect": "As a Minor Action, you take [1 Stress] and enter one of the following stances, which last until the end of the scene or until you use this Minor Action again. When you enter a stance, you gain a Stance die, a d6 that starts at 6. Each stance can be entered 1/scene.\u0085After you make an attack with a MAIN melee weapon, reduce your stance die by 2. If it reaches 0, the stance ends.\u0085Wolf Stance. Your MAIN melee weapon attacks gain Reliable equal to your stance die. The reliable damage can’t exceed the weapon’s maximum damage.\u0085Snake Stance. Your MAIN melee weapon attacks can’t have their damage reduced by armor below your stance die.\u0085Eagle Stance. When you attack with a MAIN melee weapon, before you roll any dice you can choose to treat one Accuracy die as if it had rolled your stance die value. If you roll with Difficulty, you can choose to treat one Difficulty die as if it had rolled 7 minus your stance die. (For example, if your stance die is 4, you could treat a Difficulty die as a 3. 7-4=3).",
        "rank": "2 "
    },
    {
        "id": "Soldier3",
        "talent": "Soldier",
        "name": "Practiced",
        "effect": "Your stance die is only reduced by 1 after you make an attack with a MAIN melee weapon. \u0085The following option is added to the REROLL TABLE: \u0085• Reduce your stance die by 2 to reroll.",
        "rank": "3 "
    },
    {
        "id": "Enchanter1",
        "talent": "Enchanter",
        "name": "Enchantments",
        "effect": "Each mission, you can equip one of the following Enchantment support items for free.\u0085Keen | Variable | Aspected",
        "rank": "1 "
    },
    {
        "id": "Enchanter2",
        "talent": "Enchanter",
        "name": "Portfolio of Enchantments",
        "effect": "You can apply one of your enchantments to two different things. The following enchantments are added to your list of available enchantments from rank 1 of this talent.\u0085Adamant | Speed | Vorpal",
        "rank": "2 "
    },
    {
        "id": "Enchanter3",
        "talent": "Enchanter",
        "name": "Master Enchanter",
        "effect": "One item of your choice can hold two different enchantments at a time, instead of just one. You can equip a single support item with the ENCHANTMENT tag for free, which can be an additional one from this talent.",
        "rank": "3 "
    },
    {
        "id": "Great Weapon Master1",
        "talent": "Great Weapon Master",
        "name": "Cleave",
        "effect": "1/round after you hit and deal damage with a HEAVY melee weapon attack roll, you can take [1 Stress] to Cleave. Choose another character within the weapons’ reach and Line of Sight, including HIDDEN enemies. Deal damage to that character equal to half the total damage dealt to the original target. The cleave target can’t have been a target of the original attack.",
        "rank": "1 "
    },
    {
        "id": "Great Weapon Master2",
        "talent": "Great Weapon Master",
        "name": "Carry Through",
        "effect": "When you roll damage from a HEAVY melee weapon, you can choose to treat any 1s as a 2.  \u0085When you use Cleave, instead of dealing the damage, you can choose to gain temp HP equal to the cleave damage amount. You lose this amount of temp HP at the start of your next turn. \u0085If the attack was a crit, you get both options (deal cleave damage and gain temp HP).",
        "rank": "2 "
    },
    {
        "id": "Great Weapon Master3",
        "talent": "Great Weapon Master",
        "name": "Wide Cleave",
        "effect": "When you roll damage from a HEAVY melee weapon, you can choose to treat any rolled 1s or 2s as if they rolled a 3. \u0085If you defeat an enemy with Cleave’s damaging effect, you can trigger Cleave again that turn, bypassing the 1/round limitation. This effect can trigger multiple times.  ",
        "rank": "3 "
    },
    {
        "id": "Hospitaler1",
        "talent": "Hospitaler",
        "name": "Reserves",
        "effect": "When you (1) REFRESH, you can pick 2 different options from the 2nd set of choices. ",
        "rank": "1 "
    },
    {
        "id": "Hospitaler2",
        "talent": "Hospitaler",
        "name": "Help",
        "effect": "When you (1) REFRESH, an adjacent ally gains 3 + your GRIT temp HP.",
        "rank": "2 "
    },
    {
        "id": "Hospitaler3",
        "talent": "Hospitaler",
        "name": "Medic",
        "effect": "When you (1) REFRESH, you can spend 1 REFRESHy to allow an adjacent ally to also gain the benefits of whatever options you selected. ",
        "rank": "3 "
    },
    {
        "id": "Juggernaut1",
        "talent": "Juggernaut",
        "name": "Leverage",
        "effect": "You are considered one size larger for (5) SHOVE, and you don’t suffer Difficulty from being smaller. If you succeed on a (5) SHOVE, you can decide to push the target up to 3 spaces instead of 1.",
        "rank": "1 "
    },
    {
        "id": "Juggernaut2",
        "talent": "Juggernaut",
        "name": "Locomotion",
        "effect": "1/round, if you Push a character into another character or object, the pushed character takes [1d6 Physical]. If they are pushed into another character, both must succeed on an AGILITY save against your save target or fall PRONE.",
        "rank": "2 "
    },
    {
        "id": "Juggernaut3",
        "talent": "Juggernaut",
        "name": "Runaway Train",
        "effect": "You gain the following 4 RUSH action:  \u0085(4) RUSH: You move up to your speed in a straight line, and can move through the space of other characters. Deal [10 Piercing Physical] per your size (minimum 10) to any objects in your path. If an object is destroyed, you continue moving. You ignore ENGAGEMENT and Difficult Terrain. If you move through a character, they must succeed on an AGI or be automatically affected by a (5) SHOVE from you, and be pushed out of your path.",
        "rank": "3 "
    },
    {
        "id": "Lancet1",
        "talent": "Lancet",
        "name": "Quick Step",
        "effect": "When you attack with a longarm, you can Shift 1 after the attack.",
        "rank": "1 "
    },
    {
        "id": "Lancet2",
        "talent": "Lancet",
        "name": "Poke and Prod",
        "effect": "When you crit with a longarm, the target is WEAKENED until the end of their next turn.",
        "rank": "2 "
    },
    {
        "id": "Lancet3",
        "talent": "Lancet",
        "name": "Impale",
        "effect": "1/turn when you attack with a longarm, you can turn the attack into a line attack with a length equal to the weapon’s reach. ",
        "rank": "3 "
    },
    {
        "id": "Lichdom1",
        "talent": "Lichdom",
        "name": "Soul Vessel",
        "effect": "You gain a Soul Vessel, which is a FREE Support Item with the [CONSUMABLE 1] tag.:\u0085Soul Vessel\u0085[SUPPORT] Free | Minor, Consumable 1, Summon\u0085Minor: You expend a charge and summon your Soul Vessel in a free adjacent space. While summoned, you gain the Reformed reaction. (Size 1/2, 10 HP, Dodge/A-Def 5).\u0085\u0085Reformed\u0085[Reaction]\u0085Trigger: You would take damage or Stress from another character.\u0085Effect: Negate the damage / stress and any other effects. Immediately teleport to your Soul Vessel, destroying it.",
        "rank": "1 "
    },
    {
        "id": "Lichdom2",
        "talent": "Lichdom",
        "name": "Demilich",
        "effect": "1/scene when you defeat a character, you regain 1 charge of your soul vessel support item. During a Short Rest, you can remove Wounds or Overstress with 1 Recovery.",
        "rank": "2 "
    },
    {
        "id": "Lichdom3",
        "talent": "Lichdom",
        "name": "Living Vessel",
        "effect": "When you would be defeated, your body disappears and you become a size ½ object that occupies one of your spaces. This is your living vessel, and it has 10 HP. A living vessel can take no actions and can’t move. At the start of each round, roll a d6 and gain that many charges. Once you have 6 charges, the living vessel is replaced by you, and you return with full HP, mana, and 0 Stress. If you would have 4 or more WOUNDS / OVERSTRESS, you go to 3 instead.",
        "rank": "3 "
    },
    {
        "id": "Leyline Walker1",
        "talent": "Leyline Walker",
        "name": "Leyline Sensor",
        "effect": "At the start of a combat scene, create 3 [Blast 1] zones anywhere on the map, which don’t require line of sight but can’t contain any enemy spaces. These are your leylines. If you or an ally starts their turn fully within one of these zones, roll a d6. On a 5+, they gain 1 mana. ",
        "rank": "1 "
    },
    {
        "id": "Leyline Walker2",
        "talent": "Leyline Walker",
        "name": "Leyline Drain",
        "effect": "1/round as a Reaction when a character enters one of your leyline zones, you can force them to make a MGK save. On a failure, they lose 1d3 mana, and you regain mana equal to the amount they lost. A character regains mana in these zones on a 4+ of the d6. ",
        "rank": "2 "
    },
    {
        "id": "Leyline Walker3",
        "talent": "Leyline Walker",
        "name": "Leyline Transportation",
        "effect": "Create 4 leylines at the start of combat instead of 3. While you are standing fully in one of your leylines, you can use your standard action during PHASE 4: REPOSITION to teleport to another one of your leylines. The leyline you left is destroyed. ",
        "rank": "3 "
    },
    {
        "id": "Parkour1",
        "talent": "Parkour",
        "name": "Limber",
        "effect": "You have +1 ACC on AGI checks and saves, and you move normally in Difficult Terrain. Climbing costs half as much movement as normal. Standing from PRONE costs half your movement, instead of all of your movement.",
        "rank": "1 "
    },
    {
        "id": "Parkour2",
        "talent": "Parkour",
        "name": "Rollout",
        "effect": "You can move through the spaces of hostile characters, and when you become ENGAGED, you can take [1 Stress] to not have your unused movement lost.  \u0085At the start of your turn, you can Shift 1.  \u0085When you are subjected to forced movement from another character, you can Slide yourself 1 space. You can’t Slide into a space the triggering forced movement moved you out of.",
        "rank": "2 "
    },
    {
        "id": "Parkour3",
        "talent": "Parkour",
        "name": "Free Movement",
        "effect": "When you move adjacent to a piece of terrain/object of your Size or greater, you can take [1 Stress] to move up to 2 spaces as a Free Action. You can repeat this multiple times in a turn, taking [1 Stress] each time, but not from the same piece of terrain/object twice in a row.",
        "rank": "3 "
    },
    {
        "id": "Savagery1",
        "talent": "Savagery",
        "name": "Never Down",
        "effect": "While BLOODIED, you gain +1 ACC on attacks. At the start of each of your turns while BREAKING, you gain 1 Focus.",
        "rank": "1 "
    },
    {
        "id": "Savagery2",
        "talent": "Savagery",
        "name": "Vicious",
        "effect": "You can use the REROLL TABLE on damage rolls.",
        "rank": "2 "
    },
    {
        "id": "Savagery3",
        "talent": "Savagery",
        "name": "Wild Attacker",
        "effect": "You can trigger the “If you are adjacent to an enemy or within one of their weapon’s reach, they can choose to a) OPPORTUNITY ATTACK you, or b) deal 3 Physical to you” Option from the REROLL TABLE multiple times per turn, but only from a different enemy each time.",
        "rank": "3 "
    },
    {
        "id": "Slasher1",
        "talent": "Slasher",
        "name": "Feint",
        "effect": "1/round when you hit with a blade weapon attack, you can take [1 Stress] to (3) MARK the target.",
        "rank": "1 "
    },
    {
        "id": "Slasher2",
        "talent": "Slasher",
        "name": "Hamstring",
        "effect": "1/round when you crit with a blade weapon attack, the target is SLOWED until the end of their next turn.",
        "rank": "2 "
    },
    {
        "id": "Slasher3",
        "talent": "Slasher",
        "name": "Weeping Cuts",
        "effect": "1/round when you hit with a blade weapon attack, you can choose to treat half of the attack’s damage as normal, and half of the attack’s damage as Discord instead of its normal damage type. For example, if a blade attack deals [10 Physical], you can choose to have them take [5 Physical + 5 Discord] instead.",
        "rank": "3 "
    },
    {
        "id": "Shadow1",
        "talent": "Shadow",
        "name": "Blend",
        "effect": "While INVISIBLE or benefiting from cover against all enemies that have Line of Sight to you, you can take [2 Stress] to (4) HIDE as a Minor Action.",
        "rank": "1 "
    },
    {
        "id": "Shadow2",
        "talent": "Shadow",
        "name": "Hunt",
        "effect": "You have +1 Accuracy on your first attack roll while HIDDEN on a turn. If you defeat an enemy, roll 1d6. On a 6+, you can choose to become HIDDEN.",
        "rank": "2 "
    },
    {
        "id": "Shadow3",
        "talent": "Shadow",
        "name": "Infiltration",
        "effect": "You can deploy in any empty space within [Range 5] of an edge of the map. When you roll the Hunt die from this talent, you become HIDDEN on a 5+, or if you were already HIDDEN when you defeated the enemy, you become HIDDEN on a 4+.",
        "rank": "3 "
    },
    {
        "id": "Sniper1",
        "talent": "Sniper",
        "name": "Steady Shot",
        "effect": "At the start of your turn, you can choose to IMMOBILIZE yourself until the start of your next turn. If you do so, you gain +1 ACC on all ranged attack rolls while IMMOBILIZED in this way.",
        "rank": "1 "
    },
    {
        "id": "Sniper2",
        "talent": "Sniper",
        "name": "Zero In",
        "effect": "If you miss with a ranged attack, you gain +1 ACC on ranged attacks until you hit with one. This effect stacks. ",
        "rank": "2 "
    },
    {
        "id": "Sniper3",
        "talent": "Sniper",
        "name": "Pinpoint Shot",
        "effect": "1/round when you crit with a ranged attack roll while IMMOBILIZED, you deal +1d6 bonus damage. ",
        "rank": "3 "
    },
    {
        "id": "Speedster1",
        "talent": "Speedster",
        "name": "Sprint",
        "effect": "As a Minor Action, you can take 2 Stress to move up to half your Speed. ",
        "rank": "1 "
    },
    {
        "id": "Speedster2",
        "talent": "Speedster",
        "name": "Supersonic",
        "effect": "When you (4) RUSH or use Sprint, you gain 1 Sonido. As your Standard Movement, you can spend any amount of Sonido to teleport a number of spaces equal to the Sonido spent and gain Soft Cover until the start of your next turn. You can’t use this ability if you are SLOWED. Sonido lasts between scenes, but resets to 0 during a LONG REST. You can have a maximum of 6 Sonido. ",
        "rank": "2 "
    },
    {
        "id": "Speedster3",
        "talent": "Speedster",
        "name": "Tactical Reposition",
        "effect": "When you (4) RUSH, you can use both options instead of choosing one.",
        "rank": "3 "
    },
    {
        "id": "Spellbreaker1",
        "talent": "Spellbreaker",
        "name": "Broken Concentration",
        "effect": "When you force a character to make a Concentration save, they become DAZED until the end of their next turn and take [3 Stress], which doesn’t trigger an additional Focus save.",
        "rank": "1 "
    },
    {
        "id": "Spellbreaker2",
        "talent": "Spellbreaker",
        "name": "Spell Evasion",
        "effect": "If you succeed on a save against an effect that has a reduced effect on a save, you don’t suffer those effects.",
        "rank": "2 "
    },
    {
        "id": "Spellbreaker3",
        "talent": "Spellbreaker",
        "name": "Break",
        "effect": "1/round as a Reaction when a character begins channeling within the Reach of one of your weapons, you can make an attack against them with that weapon.",
        "rank": "3 "
    },
    {
        "id": "Spotter1",
        "talent": "Spotter",
        "name": "Shotcaller",
        "effect": "1/round, when you make a target MARKED, you can force them to make a MND save. On a failure, they are SUNDERED until the end of their next turn.",
        "rank": "1 "
    },
    {
        "id": "Spotter2",
        "talent": "Spotter",
        "name": "Radar",
        "effect": "When you (7) FULL ATTACK, you can replace one or two of the actions with (3) MARK.",
        "rank": "2 "
    },
    {
        "id": "Spotter3",
        "talent": "Spotter",
        "name": "Quick Call",
        "effect": "At the start of your turn, you can take 1 stress to (3) MARK as a free action.",
        "rank": "3 "
    },
    {
        "id": "Summoner1",
        "talent": "Summoner",
        "name": "Strong Summons",
        "effect": "Your summons gain +5 HP. As a Minor Action, one of your summons within Scope can move up to 4 spaces.",
        "rank": "1 "
    },
    {
        "id": "Summoner2",
        "talent": "Summoner",
        "name": "Defender Summons",
        "effect": "Your summons may spend your Focus, and they have access to the INTERPOSE reaction. You gain 1 Focus if you end your turn within [Range 5] of one of your summons.",
        "rank": "2 "
    },
    {
        "id": "Summoner3",
        "talent": "Summoner",
        "name": "Tend to the Swarm",
        "effect": "As a Minor Action, you can spend 1 mana to restore 4 HP to one of your summons within your Scope.",
        "rank": "3 "
    },
    {
        "id": "Sun Blotter1",
        "talent": "Sun Blotter",
        "name": "Overdraw",
        "effect": "As a Minor Action, you gain 1 Stress and increase the range of your next bow attack by +5. This effect can stack multiple times, and ends when you make an attack with a bow. ",
        "rank": "1 "
    },
    {
        "id": "Sun Blotter2",
        "talent": "Sun Blotter",
        "name": "Power Shot",
        "effect": "When you make a bow attack while benefiting from this talent’s Overdraw ability, you can take [1 Stress] to choose one of the following:\u0085a. Ballista. The attack becomes a Line attack with a distance equal to the weapon’s Range, replacing the original range, but it can’t benefit from the Arcing tag.\u0085b. Catapult. On a hit, the target must pass a BLK save or be automatically affected by a SHOVE from you.\u0085c. Rain of Arrows. Create a Burst 1 area around the target, and MARK all enemies in the area. ",
        "rank": "2 "
    },
    {
        "id": "Sun Blotter3",
        "talent": "Sun Blotter",
        "name": "High Shot",
        "effect": "Whenever you fire a bow, you fire another shot into the air. Whenever you make an attack with a bow, gain 1 ARROW. Anytime you attack with a bow, you can consume all of your ARROWS, rolling an extra d20 for each shot and using the highest result for the attack roll. All ARROWS expire at the end of the scene",
        "rank": "3 "
    },
    {
        "id": "Technician1",
        "talent": "Technician",
        "name": "Growing Power",
        "effect": "Whenever you crit with a magitech weapon, you get a Power Die, which is a d6. You can have up to 6 Power Die, and they last until the end of a quest or until spent. Whenever you make an attack roll or damage roll with a magitech weapon, after the dice are rolled, you can expend any number of Power Die and roll them. The highest number rolled is added to the attack roll or to the damage roll as bonus damage.  ",
        "rank": "1 "
    },
    {
        "id": "Technician2",
        "talent": "Technician",
        "name": "Mana Ammo",
        "effect": "When you attack with a magitech weapon, you can spend up to 6 mana to increase the weapon’s Physical, Force, Astral, or Lunar damage by +1 per mana spent for that attack. The increased damage applies to every target hit by the attack.",
        "rank": "2 "
    },
    {
        "id": "Technician3",
        "talent": "Technician",
        "name": "Unstable Power Core",
        "effect": "1/round when you crit with a magitech weapon, you can apply one of the following effects:\u0085o Magnetic. The target is DISARMED until the end of their next turn.\u0085o Shielded. You gain 2 Focus.\u0085o Shock. The target is DAZED and SLOWED until the end of their next turn.\u0085o Soul Gem. The target is WEAKENED until the end of their next turn and MARKED.\u0085o Volatile. The target is SUNDERED until the end of their next turn and knocked PRONE.",
        "rank": "3 "
    },
    {
        "id": "Thaumaturge1",
        "talent": "Thaumaturge",
        "name": "Magical Charges",
        "effect": "On a crit with an artifact, regain 1 mana. ",
        "rank": "1 "
    },
    {
        "id": "Thaumaturge2",
        "talent": "Thaumaturge",
        "name": "Overcharge",
        "effect": "You gain the following (2) CHANNEL / (6) RELEASE action. (6) Release: Make an attack with an artifact weapon, including SLOW ones. The attack can’t miss.",
        "rank": "2 "
    },
    {
        "id": "Thaumaturge3",
        "talent": "Thaumaturge",
        "name": "Empowerment",
        "effect": "1/round when you hit a target with an artifact, you can spend 1 mana for one of the following effects:\u0085o Cold: Target is SLOWED until the end of their next turn. \u0085o Dark: Target is must pass a MGK save or be BLINDED until the end of their next turn. \u0085o Fire: Target takes 1 Piercing Fire damage for every space they move during their next turn.\u0085o Force: Attack gains PUSH 1 and the target is DAZED until the end of their next turn.\u0085o Light: Target is MARKED.\u0085o Lightning: Target is unable to take any reactions until the end of their next turn.\u0085o Toxic: Target gains [1 Discord].  ",
        "rank": "3 "
    },
    {
        "id": "Treasure Hunter1",
        "talent": "Treasure Hunter",
        "name": "Lucky Haul",
        "effect": "You get a loot crate. Ask you GM to generate the loot crate for you. You keep the loot even if you retrain out of this talent, but you don’t get additional loot crates if you retrain back into this talent.",
        "rank": "1 "
    },
    {
        "id": "Treasure Hunter2",
        "talent": "Treasure Hunter",
        "name": "Gambler",
        "effect": "When you get a loot crate, you can reroll either the Slot 1 or Slot 2 option once. In addition, you automatically succeed at opening locks.",
        "rank": "2 "
    },
    {
        "id": "Treasure Hunter3",
        "talent": "Treasure Hunter",
        "name": "Deep Pockets",
        "effect": "You gain an extra LIGHT support slot.",
        "rank": "3 "
    },
    {
        "id": "Warcaster1",
        "talent": "Warcaster",
        "name": "Maintain",
        "effect": "You gain +1 ACC on Concentration saves. You don’t suffer +1 DIF for ranged spell attacks while engaged.",
        "rank": "1 "
    },
    {
        "id": "Warcaster2",
        "talent": "Warcaster",
        "name": "Spellfighter",
        "effect": "All your spell attacks that have a VOLLEY or FIGHT action gain [Reach 1]. You can opportunity attack with these spells. ",
        "rank": "2 "
    },
    {
        "id": "Warcaster3",
        "talent": "Warcaster",
        "name": "Unflinching",
        "effect": "You gain resistance to physical, astral, lunar, and force damage while channeling",
        "rank": "3 "
    },
    {
        "id": "Knight1",
        "talent": "Knight",
        "name": "Phalanx",
        "effect": "When you (1) DEFEND, you can choose one of the following effects instead of gaining Focus normally:\u0085a. Roll 1d3 for each adjacent ally and take the highest result. You gain that much Focus plus your Armor.\u0085b. Gain Focus equal to 1d3 + the number of adjacent allies.",
        "rank": "1 "
    },
    {
        "id": "Knight2",
        "talent": "Knight",
        "name": "Perfect Parry",
        "effect": "When you INTERPOSE, you can also use the COUNTERATTACK reaction during the same turn.",
        "rank": "2 "
    },
    {
        "id": "Knight3",
        "talent": "Knight",
        "name": "Hunker Down",
        "effect": "Instead of using your standard movement, you can use a 2nd Minor Action, but you can’t take the same Minor Action twice in the same turn.",
        "rank": "3 "
    },
    {
        "id": "Spellblade1",
        "talent": "Spellblade",
        "name": "Spellweaver",
        "effect": "1/turn when you hit the same target with both a weapon and spell attack in the same turn, you gain 1 Spellblade point, to a maximum of 3. Spellblade points last until you Rest. During your turn, you can spend 3 Spellblade points to gain the following Minor Action until the end of the turn:\u0085Minor: You can make an attack with a LIGHT or MAIN weapon, or a spell with a (3) VOLLEY or (5) FIGHT action. This attack can’t deal bonus damage or trigger linked weapon attacks. ",
        "rank": "1 "
    },
    {
        "id": "Spellblade2",
        "talent": "Spellblade",
        "name": "Spellblade Training",
        "effect": "Whenever you hit with a weapon attack, you gain +1 ACC on your next spell attack against the target. Whenever you hit with a spell attack, you gain +1 ACC on your next weapon attack against the target. You can’t have more than +1 ACC from this talent.",
        "rank": "2 "
    },
    {
        "id": "Spellblade3",
        "talent": "Spellblade",
        "name": "Aetherblade",
        "effect": "You can link a weapon and spell together as if they were a linked weapon. Choose a LIGHT or MAIN weapon that isn’t linked to anything else, and a spell attack with a (3) VOLLEY or (5) FIGHT action. When you make an attack with either the weapon or spell, you can spend 1 Mana to also attack with the linked weapon/spell as part of the same action, regardless of which phase the 2nd attack would normally occur in. Linked attacks after the primary attack can’t benefit from bonus damage.  Unlike linked weapons, if one of the weapons or spells is destroyed, the linked weapon/spell isn’t also destroyed.",
        "rank": "3 "
    },
    {
        "id": "Metamagic1",
        "talent": "Metamagic",
        "name": "Metamagic Upgrade",
        "effect": "You can spend mana to apply one of the following effects to a Spell. A spell can only be subject to one metamagic upgrade at a time:\u0085• Distant Spell. You can spend 1 mana when you use a spell to increase the range of a spell or your Scope by +5. This can cause the spell to exceed your Scope.\u0085• Fast Spell. During your turn, you can spend mana to use a spell with a (3) SKIRMISH or (5) FIGHT action during an earlier Phase. For each Phase earlier than its normal Phase, you spend 1 mana, to a minimum of PHASE 1: BOLSTER.\u0085• Quiet Spell. You can spend 2 mana when you use a spell while HIDDEN. If you do, you remain HIDDEN after the spell resolves.",
        "rank": "1 "
    },
    {
        "id": "Metamagic2",
        "talent": "Metamagic",
        "name": "Advanced Metamagic Upgrade",
        "effect": "You add the following effects to your list of metamagic upgrades.\u0085• Flexible Spell. When you make a spell attack, you can spend 1 mana to change the defense that is targeted (DODGE or A-DEF).                                 \u0085• Heightened Spell. When you use a spell that involves a save, you can spend 2 mana to impose +1 DIF on any triggered saves when the spell is used.\u0085• RepeatedSpell. When you make a non-AOE spell attack, you can spend 3 mana to cause it to have 2 targets. Both targets must be within [Range 5] of each other and within your Scope.",
        "rank": "2 "
    },
    {
        "id": "Metamagic3",
        "talent": "Metamagic",
        "name": "Metamixer",
        "effect": "You can apply two different metamagic upgrades at once, spending the costs for each effect. In addition, you gain 1 mana when you crit with a spell attack.",
        "rank": "3 "
    },
    {
        "id": "Knife Juggler1",
        "talent": "Knife Juggler",
        "name": "Thrower",
        "effect": "Your LIGHT melee weapons gain the THROWN 3 tag, and your MAIN melee weapons gain the THROWN 1 tag. In addition, at the end of your turn all weapons you threw that turn return to you.",
        "rank": "1 "
    },
    {
        "id": "Knife Juggler2",
        "talent": "Knife Juggler",
        "name": "Perfectly Balanced",
        "effect": "All of your weapons with the THROWN tag gain +2 to their THROWN range (so a THROWN 3 weapon becomes THROWN 5). You can FIGHT with thrown LIGHT weapons during PHASE 3: SKIRMISH instead of during PHASE 5: BRAWL. You can only use this if you throw the weapon.",
        "rank": "2 "
    },
    {
        "id": "Knife Juggler3",
        "talent": "Knife Juggler",
        "name": "Flick",
        "effect": "1/round as a Minor Action, you can make a thrown weapon attack with a LIGHT weapon. This attack can’t deal bonus damage and doesn’t trigger linked attacks.",
        "rank": "3 "
    },
    {
        "id": "Gun Kata1",
        "talent": "Gun Kata",
        "name": "CQC",
        "effect": "Your ranged weapons with Reach don’t suffer +1 DIF for being ENGAGED if your target is within that weapon’s Reach.",
        "rank": "1 "
    },
    {
        "id": "Gun Kata2",
        "talent": "Gun Kata",
        "name": "Bullet Time",
        "effect": "Your LIGHT ranged weapons gain [Reach 1] if they don’t already have Reach.  \u00851/turn when you crit with a ranged attack against a target within that weapon’s Reach, you gain 1 Focus. ",
        "rank": "2 "
    },
    {
        "id": "Gun Kata3",
        "talent": "Gun Kata",
        "name": "Death Blossom",
        "effect": "You have a Gun Kata die, a d6 that starts at 1. Each time you make a Reaction attack, increase the Gun Kata die by 1, to a maximum of 6. When the die reaches 6, you can reset it to 1 during your turn as a free action to deal [6 Physical] split however you like among any enemies of your choice within [Range 3]. \u00851/turn as a Free Action you can spend 1 Focus to increase your Gun Kata die by 1. \u0085Your Gun Kata die keeps its value between scenes, but resets to 1 during a Long Rest.",
        "rank": "3 "
    }
]