[
    {
        "name": "Force Shield",
        "slot": "Light",
        "action": "-",
        "tags": [],
        "effect": "Whenever you take damage and you’re not STUNNED, you can choose to treat your Armor as equal to half your current mana. After you do so, your mana is reduced by 1. 1/round as a Reaction when you take Physical, Astral, Lunar, or Force or when you take that damage as part of the INTERPOSE reaction, you can take [2 Stress] to gain Resistance to that damage.",
        "origin": "Aegis",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Grand Infusions",
        "slot": "Main",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "2"
            }
        ],
        "effect": "You gain the following options usable on yourself or an adjacent ally: • Cleanse. Clear all conditions from the target. • Expertise. Roll 2d6. The target’s next attack roll, check, or saving throw can’t be below this number. You can spend 1 mana to reroll one of the dice. You can reroll multiple times. • False Life. Until the end of the target’s next turn, if they are reduced to 0 HP or below, or are over their stress cap, they don’t take the WOUND/OVERSTRESS. Damage and stress still continue to accumulate. If, at the end of their next turn they are still at 0 HP or less or over their stress cap, they then take the WOUND/OVERSTRESS.",
        "origin": "Alchemist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Infusions",
        "slot": "Light",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            }
        ],
        "effect": "You gain the following options: • Panacea. You or an adjacent ally clears all Discord and a condition. • Vigor. Your or an adjacent ally gains 4 temp HP and gains +1 ACC on their next ability check or save.",
        "origin": "Alchemist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Mutagen",
        "slot": "Main",
        "action": "REACTION",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            }
        ],
        "effect": "Trigger: You or a character within Scope fails an attack roll, saving throw, or check. Effect: Roll 1d6 and add the result to their total, potentially turning a failure into a success.",
        "origin": "Alchemist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Potion Injector",
        "slot": "Main",
        "action": "-",
        "tags": [],
        "effect": "Your CONSUMABLE support items can be used on targets within [Range 10], even if their effect would normally only benefit the user (like Healing Potions). Willing targets are automatically affected. Unwilling targets require a successful ranged attack against them.",
        "origin": "Alchemist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Volatile Mixtures",
        "slot": "Light",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            },
            {
                "id": "tg_thrown",
                "val": "5"
            }
        ],
        "effect": "You gain the following options: Explosive Concoction. [Thrown 5] A character within the thrown range is auto-hit by a weapon attack for [3 Astral]. You can spend 1 mana to make it a [Blast 1] area. Sticky Bomb. [Thrown 5] When thrown at a target, on a hit, they are IMMOBILIZED. They can attempt to clear the condition by succeeding on a BLK save as a Minor Action, but can’t do so until they’ve ended a turn IMMOBILIZED by this ability. When they clear the condition, they create a [Burst 1] area, dealing [2 Astral] to themselves and any characters in the area.",
        "origin": "Alchemist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Mana Siphon",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any LIGHT Weapon: On a crit with this weapon, the target loses 1 mana and you regain mana equal to the amount they lost.  Any MAIN Weapon: On a crit with this weapon, the target loses 2 mana and you regain mana equal to the amount they lost. Any HEAVY Weapon: On a crit with this weapon, the target loses 3 mana and you regain mana equal to the amount they lost.",
        "origin": "Arsenal",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Garrote",
        "slot": "Light",
        "action": "",
        "tags": [],
        "effect": "When you successfully (5) GRAPPLE a target, they are SILENCED until they are no longer GRAPPLED by you. They take [1 Piercing Physical] for every space moved while GRAPPLED in this way, to a maximum amount of damage each turn equal to your Speed. You can only garrote one target at a time, and a character can only be garroted by one character at a time. ",
        "origin": "Assassin",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Poisoner`s Kit",
        "slot": "Main",
        "action": "",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            }
        ],
        "effect": "Expend a charge when you hit with a non-Aetheric weapon attack roll. The target takes [2 Discord] and is inflicted with one of the following poisons of your choice as long as they gain the Discord. Deathbite. Until the target clears their Discord, whenever they fail the MGK check to clear their Discord, their level of Discord doubles before taking the damage. Ghoulblood. The target is WEAKENED until they clear their Discord. Midnight Malice. The target is BLINDED and can’t reveal HIDDEN enemies until they clear their Discord.",
        "origin": "Assassin",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Reaper`s Shroud",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_armor",
                "val": ""
            }
        ],
        "effect": "+1 Armor.  Whenever you defeat an enemy, you become INVISIBLE until the start of your next turn.",
        "origin": "Assassin",
        "stat_effects": {
            "armor": "1",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Bloodrage Armor",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_armor",
                "val": ""
            }
        ],
        "effect": "While BLOODIED, you gain +2 armor.",
        "origin": "Berserker",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Book of True Names",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_summon",
                "val": ""
            }
        ],
        "effect": "When you create a SUMMON, you can spend 1-3 mana. The summon gains armor equal to the mana you spent. The summon can’t have more than 3 armor.",
        "origin": "Demonologist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Skull of Kroldar",
        "slot": "Main",
        "action": "-",
        "tags": [],
        "effect": "When a character or summon within Scope is defeated, gain 1 soul essence, to a max of 6. Unused soul essence is lost during a LONG REST. Soul essence can be spent for the following effects: • Summoning Essence. Soul Essence can be spent in place of mana for abilities with the SUMMON tag. • Double Summon. 1/scene when you create a summon, you can spend 6 Soul Essence to summon another copy of that summon, which is summoned within the ability’s normal summoning restrictions. This allows a summoning ability to exceed the normal number of summons.",
        "origin": "Demonologist",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Dragon Saddle",
        "slot": "Main",
        "action": "-",
        "tags": [],
        "effect": "1/turn as a Free Action you can spend 1 mana to gain FLYING, which lasts until you end it. Whenever you move outside of your turn, you gain Soft Cover until the start of your next turn. ",
        "origin": "Dragon Rider",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Extending Enchantment",
        "slot": "Main",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Choose one of the following enchantments: Any Weapon or Technique with Reach: It gains +1 Reach and ignores the DIF from making a melee attack against a flying character. Any Weapon or Technique with Range: It gains +3 Range. Any Weapon or Technique with [Range = Scope]: Its range becomes [Scope +3].",
        "origin": "Dragon Rider",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Unliving Armor",
        "slot": "Heavy",
        "action": "-",
        "tags": [
            {
                "id": "tg_armor",
                "val": ""
            },
            {
                "id": "tg_unbreakable",
                "val": ""
            }
        ],
        "effect": "+3 armor, -1 Speed and Dodge. When you take a WOUND, you become immune to all damage and when you OVERSTRESS you become immune to all stress, and any excess damage or stress is negated. These effects last until the start of your next turn. When you are defeated, roll 1d6 at the start of each round. On a 5+, you return to action with full HP and 0 Stress and clear either 1 WOUND or OVERSTRESS to become undefeated. You return DAZED and become DAZED at the start of each of your turns until you take a LONG REST. ",
        "origin": "Gravewalker",
        "stat_effects": {
            "armor": "3",
            "speed": "-1",
            "dodge": "-1",
            "save_target": "0"
        }
    },
    {
        "name": "Ammo Crate",
        "slot": "Main",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "1"
            },
            {
                "id": "tg_summon",
                "val": ""
            }
        ],
        "effect": "(Tags: Summon, Size ½, HP 5, Dodge/A-Def 10) Minor: You place this summon in an adjacent space. You or an ally can use a Minor Action while adjacent to it to either: A) Reload one weapon, or B) Regain 2 mana. Whenever a character uses one of these options, the ammo crate’s HP is reduced by 2. If the ammo crate is defeated through damage, it explodes in a Burst 1 area. All characters in the area must make an AGI save. Failure: [8 Force]. Success: Half damage.",
        "origin": "Gunslinger",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Curve Ammo",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Ranged Weapon or Skill/Spell Attack: When you make a ranged attack with this ability, you can spend 1 mana to ignore Line of Sight as long as there is a potential path to the target, but cover still applies. You can spend 2 mana to gain the Homing tag for the attack.",
        "origin": "Gunslinger",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Bound Weapon",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Weapon: The weapon gains the Unbreakable tag, and returns to you if thrown after the attack resolves. This weapon can be used even if you are DISARMED. Any Technique: The technique gains the Unbreakable tag. If it’s a spell, it can be used even if you are SILENCED.",
        "origin": "Hexblade",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Recurring Dream",
        "slot": "Main",
        "action": "",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Weapon: Whenever you hit with this weapon, you can VOLLEY, FIGHT, or in the case of SLOW weapons, FULL ATTACK with it 1 phase sooner than normal as long as you attack the same target, to a minimum of PHASE 1. This effect stacks and lasts until the end of the scene or until you attack a different target with this weapon Any Technique that forces a Save: 1/turn if a target pass a save triggered by this technique, its save target increases by +1 until the end of the scene or until a target fails the save, at which point it resets back to normal. This effect can stack.",
        "origin": "Knightmare",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Stalwart Shield",
        "slot": "Main",
        "action": "-",
        "tags": [
            {
                "id": "tg_unbreakable",
                "val": ""
            }
        ],
        "effect": "+1 Armor Allied characters gain the benefits of cover as if you were a piece of Hard Cover. 1/round as a Reaction when you or an adjacent ally takes Physical, Astral, Lunar, or Force or when you take that damage as part of the INTERPOSE reaction, you can take [2 Stress] to grant yourself or the ally Resistance to that damage.",
        "origin": "Paladin",
        "stat_effects": {
            "armor": "1",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Royal Phoenix Armor",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_armor",
                "val": ""
            },
            {
                "id": "tg_unbreakable",
                "val": ""
            }
        ],
        "effect": "+1 Armor.  Enemies within [Range 5] of you must use your Save Target when making the check to clear their Discord instead of the normal target number of 10. Adjacent enemies must use your Save Target +2. ",
        "origin": "Phoenix",
        "stat_effects": {
            "armor": "1",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Flicker Enchantment",
        "slot": "Light",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Armor: 1/round as a REACTION when you take damage, you can immediately teleport up to 1d6 spaces.  Any Weapon: 1/round when you crit with this weapon, you can teleport the target up to 1d6 spaces.",
        "origin": "Riftblade",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Portal Gun",
        "slot": "Main",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_mana",
                "val": "1"
            }
        ],
        "effect": "You can teleport an ally or enemy within [Range 10] up to 3 spaces, which counts as forced movement. An unwilling character can make a MGK save to resist the effect",
        "origin": "Riftblade",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Sensor Suite Goggles",
        "slot": "Light",
        "action": "-",
        "tags": [],
        "effect": "You know the current HP, Stress, and Mana of all MARKED enemies. 1/turn you can reroll the miss chance from the INVISIBLE status when attacking an INVISIBLE target.",
        "origin": "Riftblade",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Frozen Throne",
        "slot": "Main",
        "action": "Free Action",
        "tags": [
            {
                "id": "tg_mana",
                "val": "2"
            }
        ],
        "effect": "You create a [Burst 1] area of growing cold around you. Enemies that start their turn in this area take [2 Lunar]. At the start of each of your turns while activated, the damage of this ability increases by +2, and you take the current damage (after it is increased), which bypasses your Armor.   You can deactivate this ability as a Free Action, which resets the damage back to its base value of 2.",
        "origin": "Rimeguard",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Aetheric Collector",
        "slot": "Main",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            },
            {
                "id": "tg_trap",
                "val": ""
            }
        ],
        "effect": "You gain the following trap options: Mana Collector. When triggered, creates a [Burst 2] area. All enemies in the area must make a MGK save. Failure: they lose all their mana. Success: They lose mana equal to half their mana maximum. The trap collects all of the mana lost from this ability and remains on the field as a special terrain feature. You or an ally can use a Minor Action while adjacent to the trap to regain mana equal to the amount it has collected. The trap is then removed from play Vitality Collector. When triggered, creates a [Burst 2] area. All enemies in the area must make a MGK save. Failure: They take [4 Stress] and are WEAKENED until the end of their next turn. Success: They take [4 Stress]. The trap counts all of the Stress given from this effect and remains on the field as a special terrain feature. You or an ally can use a Minor Action while adjacent to the trap to regain HP up to the total Stress it had given. The trap is then removed from play. ",
        "origin": "Shadebinder",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Aetheric Diverter",
        "slot": "Light",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            },
            {
                "id": "tg_trap",
                "val": ""
            }
        ],
        "effect": "You gain the following trap options: Focused. Choose either Astral or Lunar damage when deployed. When triggered, this trap creates a [Line 8] area aimed in any direction. All characters in the area take [6 Damage] of the chosen type. Nova. Choose either Astral or Lunar damage when deployed. When triggered, this trap creates a [Burst 3] area, dealing [8 Damage] of the chosen type to all characters in the area. The damage is reduced by 2 for every space beyond [Range 1] a character is from the trap. All characters in the Burst area must make an AGI save, reducing this damage by half on a success ",
        "origin": "Shadebinder",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Buddy Bond",
        "slot": "Light",
        "action": "",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Support Item/Technique that Doesn’t Require an Action to Activate: When you create a summon, you can choose for them to also benefit from this ability, which lasts until they are defeated or dismissed. The summon doesn’t gain the ability to use any actions granted by this item/technique, they only gain the passive benefits. Only 1 summon can benefit from this ability at a time. Any Equipment/Technique with the Summon Tag: Whenever you regain HP, this summon regains half as much HP. This only affects the summon if they are currently summoned. ",
        "origin": "Shadebinder",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Capture Orb",
        "slot": "Main",
        "action": "(3) SKIRMISH",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "6"
            },
            {
                "id": "tg_thrown",
                "val": "5"
            }
        ],
        "effect": "This item starts with the Empty profile. Empty. As a Minor Action, expend a charge and make a thrown melee weapon attack at a character within range. On a hit, they must make a MAGIC save. They have +1 Difficulty if they are BLOODIED, +1 Difficulty if they are BREAKING, and an additional +1 Difficulty for every condition they have. Failure: They are STUNNED and IMMOBILIZED until the end of their next turn. Success: They are DAZED until the end of their next turn. When a target fails this save, make note of their current HP and Mana. Gain the Full profile. Full. As a Minor Action, one character within the item’s Thrown range gains temp HP equal to the noted HP plus mana from the Empty profile. The item gains the Empty profile. This effect does not consume a charge. ",
        "origin": "Shadebinder",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Trainer Items",
        "slot": "Main",
        "action": "Reaction (1/round)",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "3"
            }
        ],
        "effect": "You gain the following Reactions: Revive. Reaction (1/Round)  Trigger: One of your summons within Scope would be defeated.  Effect: Expend a charge. The summon is not defeated, and has their HP set to their BLOODIED value. Return. Reaction (1/Round)  Trigger: A character starts their turn.  Effect: Expend a charge. One of your summons in the scene (ignoring Line of Sight) is teleported to a free space adjacent to you.",
        "origin": "Shadebinder",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Parrying Dagger",
        "slot": "Main",
        "action": "REACTION, 1/round",
        "tags": [],
        "effect": "Trigger: An attack roll would hit your DODGE. Effect: Make a melee attack roll. Your DODGE for the triggering attack becomes this attack roll value, potentially turning a hit into a miss.  If the attack misses, you can spend 1 Focus to deal [3 Stress] to the attacker.",
        "origin": "Skald",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Adamant",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Armor: As a Minor Action, gain 1 Focus. Any Weapon or Spell Attack: On Crit, gain 1 Focus.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Aspected",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Armor: This armor gains +1 ACC to checks and saves with BULK, AGILITY, MIND, or MAGIC, chosen when you equip this enchantment. Any Weapon, Support, Spell, or Skill Attack: When you attack with it, you can spend 1 mana to give the attack the Aetheric tag, or to remove the Aetheric tag. The change lasts until the end of the scene or you use this ability again.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Keen",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Weapon or Skill/Spell Attack That Deals Damage: On Crit: Deal +1d3 bonus damage. Any Weapon or Skill/Spell Attack That Deals Stress: On Crit: Deal +2 Stress. Any Weapon or Skill/Spell Attack that Deals Discord: On Crit: Deal +1 Discord.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Soul Vessel",
        "slot": "Free",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "1"
            },
            {
                "id": "tg_summon",
                "val": ""
            }
        ],
        "effect": "Minor: You expend a charge and summon your soul vessel in a free adjacent space. While summoned, you gain the Reformed reaction. (Size 1/2, 10 HP, Dodge/A-Def 5).",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Speed",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Weapon without Slow: You can (3) VOLLEY or (5) FIGHT with this weapon during PHASE 1: BOLSTER. Any Armor: You can RUSH, HIDE, or take actions only available during PHASE 4: REPOSITION during PHASE 1: BOLSTER.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Variable",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Weapon, Support Item, or Technique: Any Weapon, Support Item, or Technique: Before each quest and when you (1) RECOVER or Rest, you can change any of its damage types. You can change Physical, Astral, Lunar, or Force damage to one of those types. If it deals Discord or Stress, you can change the Discord to Stress or vice versa.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Vorpal",
        "slot": "Free",
        "action": "-",
        "tags": [
            {
                "id": "tg_enchantment",
                "val": ""
            }
        ],
        "effect": "Any Melee Weapon: 1/round when you make a melee attack with this weapon and a damage die rolls its highest value, roll the die again and add that result to the total damage. This effect can trigger multiple times. Only the damage from the weapon triggers this effect, not any bonus damage or extra sources of damage. If you score a critical hit, resolve which damage dice are being used before doing any of the rerolls.",
        "origin": "Talent",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Bottled Lightning",
        "slot": "Light",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_consumable",
                "val": "2"
            }
        ],
        "effect": "Minor: Create a Burst 2 area. Characters partly within the area and with Line of Sight to you are BLINDED until the end of their next turn.",
        "origin": "Thunderclaw",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Kinetic Redistributor",
        "slot": "Main",
        "action": "REACTION (1/round)",
        "tags": [],
        "effect": "Trigger: A ranged attack roll is made against you.  Effect: Choose to either impose +1 DIF on the attack, or gain 2 Focus.",
        "origin": "Thunderclaw",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Earthwarden`s Shield",
        "slot": "Main",
        "action": "-",
        "tags": [],
        "effect": "1 Armor. When you INTERPOSE, you can spend an additional Focus to gain resistance to any damage from the attack.",
        "origin": "Warden",
        "stat_effects": {
            "armor": "1",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    },
    {
        "name": "Standard of Courage",
        "slot": "Main",
        "action": "Minor",
        "tags": [
            {
                "id": "tg_summon",
                "val": ""
            }
        ],
        "effect": "(Tags: Summon, Size ½, 5 HP, 10 Dodge/A-Def) This summon must be summoned in a free adjacent space. While summoned, it emits a [Burst 2] zone. You and all allied characters in the zone gain +1 ACC on attack rolls, checks, and saves, and when you or an ally starts their turn in the zone, they gain 2 temp HP. During your turn, you can pick up and move the summon when you move, placing it in another free adjacent space. This summon can only be dismissed with a Minor Action while adjacent to it. It keeps its current HP value when dismissed, and regains all HP during a REST. If defeated, this support item is destroyed. ",
        "origin": "Warlord",
        "stat_effects": {
            "armor": "0",
            "speed": "0",
            "dodge": "0",
            "save_target": "0"
        }
    }
]